
GetPassphraseDescription = "You need a password to unlock the secret key for user: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "You need a password to unlock the secret key for user: \"%@\", ID %@, (main key ID %@)";
PassphraseLabel = "パスワード:";




/* For Key-Status */
"Invalid" = "無効";
"Revoked" = "失効済";
"Expired" = "期限切れ";
"Disabled" = "無効";
"Unknown" = "不明";
"Never" = "不信";
"Marginal" = "一部";
"Full" = "完全";
"Ultimate" = "究極";


/* For Undo and Redo */
Undo_NewKey = "新しい鍵";
Undo_Delete = "削除";
Undo_CleanKey = "クリーン";
Undo_MinimizeKey = "最小化";
Undo_RevokeKey = "鍵を無効化";
Undo_ChangeExpirationDate = "有効期限を変更";
Undo_ChangePassphrase = "パスワードを変更";
Undo_AlgorithmPreferences = "アルゴリズム設定を変更";
Undo_Import = "インポート";
Undo_AddSignature = "署名を追加";
Undo_RemoveSignature = "署名を削除";
Undo_RevokeSignature = "署名を失効";
Undo_AddSubkey = "副鍵を追加";
Undo_RemoveSubkey = "Remove Subkey";
Undo_RevokeSubkey = "Revoke Subkey";
Undo_AddUserID = "Add UserID";
Undo_RemoveUserID = "Remove UserID";
Undo_RevokeUserID = "Revoke UserID";
Undo_PrimaryUserID = "Primary UserID";
Undo_AddPhoto = "Add Photo";
Undo_RefreshFromServer = "サーバーから更新";
Undo_ReceiveFromServer = "サーバーから受信";



/* Algorithm names */
CIPHER_ALGO_NONE = "None";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "None";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "アルゴリズム_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "署名しました";
"Signature expired" = "署名が有効期限切れです";
"Key expired" = "鍵が有効期限切れです";
"Bad signature" = "Signature and data do not match. This could mean the data has been tampered with.";
"Signature revoked" = "Signature revoked";
"Signature error" = "署名エラー";
"Unverifiable signature" = "Signature can not be verified.";
"Signed by stranger" = "Signature can not be verified, because the corresponding public key is missing.";


/* Key Descriptions */
KeyDescriptionAndMore = "and %lu more";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Warning: Your key is about to expire";
KeyExpiryWarning_Msg = "Your key will expire on %1$@:\n\n%2$@\n\nExpired keys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this key.\n\nIf you choose to extend your key, it will be valid for two more years.\n\nDo you want to extend your key?";
KeyExpiryWarning_Yes = "Extend Key";
KeyExpiryWarning_No = "キャンセル";
KeyExpiryWarning_Suppress = "Do Not Ask Again";

SubkeyExpiryWarning_Title = "Warning: Your subkey is about to expire";
SubkeyExpiryWarning_Msg = "Your subkey will expire on %1$@:\n\n%2$@\n\nExpired subkeys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this subkey.\n\nIf you choose to extend your subkey, it will be valid for two more years.\n\nDo you want to extend your subkey?";
SubkeyExpiryWarning_Yes = "Extend Subkey";
SubkeyExpiryWarning_No = "キャンセル";
SubkeyExpiryWarning_Suppress = "Do Not Ask Again";

WrongPasswordTryAgain_Title = "You entered the wrong password";
WrongPasswordTryAgain_Msg = "Do you want to try it again?";
WrongPasswordTryAgain_Yes = "Try Again";
WrongPasswordTryAgain_No = "キャンセル";

KeyExpiryFailed_Title = "Failed to extend your key!";
KeyExpiryFailed_Msg = "The key\n%1$@\ncould not be extened.\n\nError: %2$@";

KeyExtendedWantToUpload_Title = "Your key was extended successfully";
KeyExtendedWantToUpload_Msg = "In order for others to be able to see the new expiration date, it is necessary for them to import your updated key. Therefore it is recommended to upload your updated public key to the key servers.\n\nWarning: Key servers are public, so the name and email you use in your key will be publicly visible. Keys can not be deleted from the key servers. They can be revoked but not removed.\n\nIf you rather prefer not to use key servers, please consider attaching your public key to your signed and encrypted emails.\n\nDo you want to upload your public key?";
KeyExtendedWantToUpload_Yes = "公開鍵をアップロード";
KeyExtendedWantToUpload_No = "No, Thanks!";

UploadFailed_Title = "Failed to upload the key!";
UploadFailed_Msg = "The key could not be uploaded to the keyserver.\n\nError: %@";


UpdaterNotWorking_Title = "The GPG Suite Updater doesn't work as expected!";
UpdaterNotWorking_Msg = "https://gpgtools.org から GPG Suiteをダウンロードして再インストールしてください。";


SwitchToOldKeyserver_Title = "Warning: You are about to switch the key server";
SwitchToOldKeyserver_Msg = "Switching to the old key servers will lower the quality of search results. While keys.openpgp.org allows verification of the email address and only then will show the email in search results, the old key servers do not support that mechanism.\n\nWe recommend to keep using keys.openpgp.org\n\nDo you really want to switch the key server?";
SwitchToOldKeyserver_No = "キャンセル";
SwitchToOldKeyserver_Yes = "Switch to old Key Server";


